app/Livewire/Components/ModalCategory.php

insert into `kategori` (`nama_kategori`, `id_toko`, `updated_at`, `created_at`) values ('Minuman', 1, '2025-06-07 02:14:42', '2025-06-07 02:14:42')
---
    public function saveCategory()
    {
        $this->validate([
            'new_category_name' => 'required|string|max:50'
        ]);

        $kategori = new Kategori();
        $kategori->nama_kategori = $this->new_category_name;
        $kategori->id_toko = Auth::user()->id_toko;
        $kategori->save();