app/Livewire/Components/ModalCategory.php

    public function saveCategory()
    {
        $this->validate([
            'new_category_name' => 'required|string|max:50'
        ]);

        $kategori = new Kategori();
        $kategori->nama_kategori = $this->new_category_name;
        $kategori->id_toko = $this->id_toko;
        $kategori->save();
---
insert into `kategori` (`nama_kategori`, `id_toko`, `updated_at`, `created_at`) values ('Musik', 1, '2025-06-07 05:02:51', '2025-06-07 05:02:51')