app/Livewire/Pages/Home.php

select * from `produk` where `id_toko` = 1 and `produk`.`deleted_at` is null
---
    public function mount()
    {
        // Ambil data produk dengan kolom yang sesuai
        $this->products = Produk::where('id_toko', Auth::user()->id_toko)->get();

select * from `produk` where `produk`.`id` = 1 and `produk`.`deleted_at` is null limit 1
---
    public function addToCart($productId)
    {
        $product = Produk::findOrFail($productId);

select * from `produk` where `produk`.`id` = 2 and `produk`.`deleted_at` is null limit 1
select * from `transaksi` where `id_toko` = 1 and `transaksi`.`deleted_at` is null order by `id` desc limit 1
insert into `transaksi` (`nomor_nota`, `id_kasir`, `id_pelanggan`, `id_toko`, `total`, `jumlah_bayar`, `kembalian`, `updated_at`, `created_at`) values ('TRX-006', 1, null, 1, 99009, 100000, 991, '2025-06-08 03:48:01', '2025-06-08 03:48:01')
---
    public function checkout()
    {
        // Validasi input bayar
        if ($this->inputBayar < $this->total) {
            session()->flash('error', 'Uang pembayaran kurang!');
            return;
        }

        // Validasi stok produk
        foreach ($this->cart as $item) {
            $product = Produk::find($item['id']);
            if ($product->stok < $item['quantity']) {
                session()->flash('error', 'Stok produk ' . $product->nama_produk . ' tidak mencukupi!');
                return;
            }
        }

        // Mulai transaksi database
        DB::beginTransaction();
        try {
            // Generate nomor nota (contoh: TRX-001)
            $lastTransaksi = Transaksi::where('id_toko', Auth::user()->id_toko)
                ->orderBy('id', 'desc')
                ->first();
            $nomorNota = 'TRX-' . str_pad($lastTransaksi ? $lastTransaksi->id + 1 : 1, 3, '0', STR_PAD_LEFT);

            // Simpan transaksi
            $transaksi = Transaksi::create([
                'nomor_nota' => $nomorNota,
                'id_kasir' => Auth::id(),
                'id_pelanggan' => null, // Jika ada pelanggan, bisa disesuaikan
                'id_toko' => Auth::user()->id_toko,
                'total' => $this->total,
                'jumlah_bayar' => $this->inputBayar,
                'kembalian' => $this->kembalian,
            ]);

insert into `detail_transaksi` (`id_transaksi`, `id_produk`, `jumlah`, `harga_satuan`, `updated_at`, `created_at`) values (6, 2, 1, '90009.00', '2025-06-08 03:48:01', '2025-06-08 03:48:01')
select * from `produk` where `produk`.`id` = 2 and `produk`.`deleted_at` is null limit 1
update `produk` set `stok` = 1, `produk`.`updated_at` = '2025-06-08 03:48:01' where `id` = 2
insert into `riwayat_stok` (`id_produk`, `perubahan_stok`, `tipe`, `harga_satuan`, `id_pengguna`, `id_toko`, `updated_at`, `created_at`) values (2, 1, 'keluar', '90009.00', 1, 1, '2025-06-08 03:48:01', '2025-06-08 03:48:01')
---
            // Simpan detail transaksi dan kurangi stok
            foreach ($this->cart as $item) {
                // Simpan detail transaksi
                DetailTransaksi::create([
                    'id_transaksi' => $transaksi->id,
                    'id_produk' => $item['id'],
                    'jumlah' => $item['quantity'],
                    'harga_satuan' => $item['harga'],
                ]);

                // Kurangi stok produk
                $product = Produk::find($item['id']);
                $product->stok -= $item['quantity'];
                $product->save();

                // Catat riwayat stok
                RiwayatStok::create([
                    'id_produk' => $item['id'],
                    'perubahan_stok' => $item['quantity'],
                    'tipe' => 'keluar',
                    'harga_satuan' => $item['harga'],
                    'id_pengguna' => Auth::id(),
                    'id_toko' => Auth::user()->id_toko,
                ]);