app/Livewire/Pages/Product.php

select * from `kategori` where `id_toko` = 1 and `kategori`.`deleted_at` is null
---
    public function refreshCategories()
    {
        $this->categories = Kategori::where('id_toko', $this->id_toko)->get();

insert into `produk` (`kode`, `nama_produk`, `harga`, `stok`, `id_kategori`, `id_toko`, `gambar`, `updated_at`, `created_at`) values ('AKSU1', 'Treker', '1999999', '1', '3', 1, 'produk/OjozHnQpUiQ75juhwFBn8BGFrRJGLJ3eCCNiSNID.jpg', '2025-06-07 02:34:16', '2025-06-07 02:34:16')
insert into `riwayat_stok` (`id_produk`, `perubahan_stok`, `tipe`, `harga_satuan`, `id_pengguna`, `id_toko`, `updated_at`, `created_at`) values (3, '1', 'masuk', '1999999', 1, 1, '2025-06-07 02:34:16', '2025-06-07 02:34:16')
---
    public function saveProduct()
    {
        \Log::info('Attempting to save product', [
            'data' => [
                'kode' => $this->kode,
                'nama_produk' => $this->nama_produk,
                'harga' => $this->harga,
                'stok' => $this->stok
            ]
        ]);

        try {
            $validated = $this->validate();
            \Log::info('Validation passed', $validated);

            DB::beginTransaction();

            $data = [
                'kode' => $this->kode,
                'nama_produk' => $this->nama_produk,
                'harga' => $this->harga,
                'stok' => $this->stok,
                'id_kategori' => $this->id_kategori ?: null,
                'id_toko' => $this->id_toko,
            ];

            if ($this->gambar) {
                $data['gambar'] = $this->gambar->store('produk', 'public');
            }

            $produk = Produk::create($data);
            \Log::info('Product created', ['product_id' => $produk->id]);

            if ($this->stok > 0) {
                RiwayatStok::create([
                    'id_produk' => $produk->id,
                    'perubahan_stok' => $this->stok,
                    'tipe' => 'masuk',
                    'harga_satuan' => $this->harga,
                    'id_pengguna' => auth()->id(),
                    'id_toko' => $this->id_toko,
                ]);

select * from `produk` where `produk`.`id` = 1 and `produk`.`deleted_at` is null limit 1
---
    public function edit($id)
    {
        \Log::info('Editing product', ['id' => $id]);
        $this->isEdit = true;
        $produk = Produk::findOrFail($id);

select * from `kategori` where `kategori`.`id` in (1) and `kategori`.`deleted_at` is null
select * from `produk` where `id_toko` = 1 and `produk`.`deleted_at` is null
select * from `kategori` where `id_toko` = 1 and `kategori`.`deleted_at` is null
select * from `kategori` where `kategori`.`id` in (1, 3) and `kategori`.`deleted_at` is null
---
    public function render()
    {
        \Log::info('Rendering product component');

        $query = Produk::with(['kategori'])->where('id_toko', $this->id_toko);

        if ($this->search) {
            $query->where(function ($q) {
                $q->where('nama_produk', 'like', '%' . $this->search . '%')
                  ->orWhere('kode', 'like', '%' . $this->search . '%');
            });
        }

        $products = $query->get();
        $categories = Kategori::where('id_toko', $this->id_toko)->get();