app/Livewire/Auth/Login.php

    public function login()
{
    logger('Metode login() dipanggil'); // Log pertama

    $this->validate();
    logger('Validasi selesai'); // Log kedua

    $user = Pengguna::where('username', $this->username)->first();

    logger('User ditemukan', ['user' => $user]); // Log ketiga

    if ($user && Hash::check($this->password, $user->password)) {
        logger('Login berhasil'); // Log keempat

        Auth::login($user, $this->remember);
        session()->regenerate();

        // Atur session toko
        if ($user->peran === 'admin') {
            $toko = Toko::where('id_admin', $user->id)->first();
---
select * from `pengguna` where `username` = 'donite' and `pengguna`.`deleted_at` is null limit 1
select * from `toko` where `id_admin` = 1 and `toko`.`deleted_at` is null limit 1